In [43]:
import numpy as np
import pandas as pd

In [44]:
a=[1,2,3,4,5]
a_array = np.array(a)
a_series = pd.Series(a)

print(a)
print(a_array)
print(a_series)

[1, 2, 3, 4, 5]
[1 2 3 4 5]
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [45]:
a=pd.Series([1,2,3,4,5])
print(a)

b=pd.Series([1,3,5,np.nan,6,8])
print(b)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [46]:
a =pd.Series([10000,20000,30000,40000,50000])
# print(a)
# print(a[0])
# print(a[2])

# Series의 인덱싱을 date로 변경
dates = pd.date_range('20160801', periods = 5)
a = pd.Series([10000,20000,30000,40000,50000], index = dates)
print(a)
print(a['2016-08-01'])
print(a[0])

2016-08-01    10000
2016-08-02    20000
2016-08-03    30000
2016-08-04    40000
2016-08-05    50000
Freq: D, dtype: int64
10000
10000

C:\Users\peng2\AppData\Local\Temp\ipykernel_38532\519966529.py:11: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(a[0])

In [47]:
#WikiDocs [파이썬을 이용한 시스템 트레이딩(기초편)]에서 가져온 예제
mine = pd.Series([10,20,30], index=['naver','skt','kt'])
wife = pd.Series([10,30,20], index=['kt','naver','skt'])

print("내 주식")
print(mine)
print("아내 주식")
print(wife)

family = mine + wife
print(family)

내 주식
naver    10
skt      20
kt       30
dtype: int64
아내 주식
kt       10
naver    30
skt      20
dtype: int64
kt       40
naver    40
skt      40
dtype: int64

# 2. DataFrame

- 2차원 형태의 자료구조
- R의 dataframe과 거의 유사

> R은 통계 계산과 데이터 시각화를 위한 프로그래밍 언어 및 환경입니다. R은 특히 통계학자, 데이터 분석가, 데이터 과학자 등의 전문가들 사이에서 널리 사용되며, 데이터 분석 및 시각화 작업에 특화된 다양한 패키지와 라이브러리를 제공합니다. R은 무료로 사용할 수 있으며, 오픈 소스 기반의 프로젝트로 개발되고 있습니다.

In [48]:
# from WikiDocs

#Dictionary 형태
raw_data = {'col0':[1,2,3,4],
            'col1':[10,20,30,40],
            'col2':[100,200,300,400]}
print(raw_data)
data = pd.DataFrame(raw_data)
print(data)
print(data['col1'])

print(type(raw_data))
print(type(data))
print(type(data['col1']))

{'col0': [1, 2, 3, 4], 'col1': [10, 20, 30, 40], 'col2': [100, 200, 300, 400]}
   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400
0    10
1    20
2    30
3    40
Name: col1, dtype: int64
<class 'dict'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [49]:
df = pd.DataFrame({ 'A':1.,
                   'B': pd.Timestamp('20240325'),
                   'C':pd.Series(1,index=list(range(4)), dtype='float32'),
                   'D': np.array([3]*4, dtype='int32'),
                   'E':pd.Categorical(['test','train','test','train']),
                   'F':'foo'})

print(df)
print(df.dtypes)
print(df.head(2))
print(df.tail(2))

     A          B    C  D      E    F
0  1.0 2024-03-25  1.0  3   test  foo
1  1.0 2024-03-25  1.0  3  train  foo
2  1.0 2024-03-25  1.0  3   test  foo
3  1.0 2024-03-25  1.0  3  train  foo
A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object
     A          B    C  D      E    F
0  1.0 2024-03-25  1.0  3   test  foo
1  1.0 2024-03-25  1.0  3  train  foo
     A          B    C  D      E    F
2  1.0 2024-03-25  1.0  3   test  foo
3  1.0 2024-03-25  1.0  3  train  foo

In [50]:
data = {'temperature':[29,34,37,32,30],
        'humidity':['mid','high','high','mid','low'],
        'weather':['cloudy','sunny','rainy','cloudy','sunny']}

a=pd.DataFrame(data)
print(a)

   temperature humidity weather
0           29      mid  cloudy
1           34     high   sunny
2           37     high   rainy
3           32      mid  cloudy
4           30      low   sunny

In [51]:
a

   temperature humidity weather
0           29      mid  cloudy
1           34     high   sunny
2           37     high   rainy
3           32      mid  cloudy
4           30      low   sunny

In [52]:
#index에 날짜 넣기
date = ['2016-08-01','2016-08-02','2016-08-03','2016-08-04','2016-08-05']
#변수의 순서 정하기
feature = ['temperature', 'humidity', 'weather']
b=pd.DataFrame(data, columns=feature, index=date)
print(b)

            temperature humidity weather
2016-08-01           29      mid  cloudy
2016-08-02           34     high   sunny
2016-08-03           37     high   rainy
2016-08-04           32      mid  cloudy
2016-08-05           30      low   sunny

In [53]:
b

            temperature humidity weather
2016-08-01           29      mid  cloudy
2016-08-02           34     high   sunny
2016-08-03           37     high   rainy
2016-08-04           32      mid  cloudy
2016-08-05           30      low   sunny

In [54]:
b.temperature

2016-08-01    29
2016-08-02    34
2016-08-03    37
2016-08-04    32
2016-08-05    30
Name: temperature, dtype: int64

In [55]:
b['temperature']

2016-08-01    29
2016-08-02    34
2016-08-03    37
2016-08-04    32
2016-08-05    30
Name: temperature, dtype: int64

In [56]:
b.loc['2016-08-01']

temperature        29
humidity          mid
weather        cloudy
Name: 2016-08-01, dtype: object

In [57]:
#DataFrame에 'windy'라는 새로운 열을 추가
windy = ['yes','no','yes','yes','no']
b['windy'] = windy
b

            temperature humidity weather windy
2016-08-01           29      mid  cloudy   yes
2016-08-02           34     high   sunny    no
2016-08-03           37     high   rainy   yes
2016-08-04           32      mid  cloudy   yes
2016-08-05           30      low   sunny    no

In [58]:
#temperature가 30도 이하이고, weather가 sunny이면
#나가서 논다는 데이터를 입력해보자.
b['play'] = (b['temperature']<=30)&(b['weather']=='sunny')
b

            temperature humidity weather windy   play
2016-08-01           29      mid  cloudy   yes  False
2016-08-02           34     high   sunny    no  False
2016-08-03           37     high   rainy   yes  False
2016-08-04           32      mid  cloudy   yes  False
2016-08-05           30      low   sunny    no   True

In [59]:
b.T

            2016-08-01 2016-08-02 2016-08-03 2016-08-04 2016-08-05
temperature         29         34         37         32         30
humidity           mid       high       high        mid        low
weather         cloudy      sunny      rainy     cloudy      sunny
windy              yes         no        yes        yes         no
play             False      False      False      False       True

In [60]:
del b['humidity']
b

            temperature weather windy   play
2016-08-01           29  cloudy   yes  False
2016-08-02           34   sunny    no  False
2016-08-03           37   rainy   yes  False
2016-08-04           32  cloudy   yes  False
2016-08-05           30   sunny    no   True

# 3. Data join

In [61]:
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1,2,3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [62]:
B=pd.DataFrame({'color':['green','yellow','pink'], 'size':['S','M','L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

In [63]:
pd.merge(left=A,right=B,how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

In [64]:
pd.merge(A,B,how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

In [65]:
pd.merge(A,B,how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

In [66]:
pd.merge(A,B,how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

In [67]:
pd.merge(A,B,how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L

In [69]:
movie_file = 'data/movie.txt'
movie_cols = ['movie_id', 'title']
movies = pd.read_table(movie_file, sep='|', header=None, names=movie_cols, usecols=[0,1])
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [72]:
rating_file = 'data/movie_rating.txt'
rating_cols = ['user_id','movie_id','rating','timestamp']
ratings = pd.read_table(rating_file, sep='\t', header=None, names=rating_cols)
ratings.head()

  user_id  movie_id  rating    timestamp
0     196       242       3  881250949.0
1     186       302       3  891717742.0
2      22       377       1  878887116.0
3     244        51       2  880606923.0
4     166       346       1  886397596.0

In [73]:
movie_ratings = pd.merge(movies, ratings)
movie_ratings.head()

   movie_id             title user_id  rating    timestamp
0         1  Toy Story (1995)     308       4  887736532.0
1         1  Toy Story (1995)     287       5  875334088.0
2         1  Toy Story (1995)     148       4  877019411.0
3         1  Toy Story (1995)     280       4  891700426.0
4         1  Toy Story (1995)      66       3  883601324.0

In [74]:
print(movies.shape)
print(ratings.shape)
print(movie_ratings.shape)

(1682, 2)
(100000, 4)
(100000, 5)

# 0325 완료